#! /usr/bin/python3
# -*- coding: utf-8 -*-

guests = ['Герман', 'Алёна', 'Саша', 'Катерина', 'Данил', 'Коля']

print('Список гостей')

print(guests[0] + ' приглашается на обед 02.06.2021 в 19.00')
print(guests[1] + ' приглашается на обед 02.06.2021 в 19.00')
print(guests[2] + ' приглашается на обед 02.06.2021 в 19.00')
print(guests[3] + ' приглашается на обед 02.06.2021 в 19.00')
print(guests[4] + ' приглашается на обед 02.06.2021 в 19.00')
print(guests[5] + ' приглашается на обед 02.06.2021 в 19.00')
