'''
Created on 2 мая 2018 г.

@author: danny
#*****************************************************************
#
#Двусвязный список = возраст шотладнского котенка и его норма веса
#
#*****************************************************************
'''
#-*- coding:utf-8 -*-

scottish = {}


scottish['1 неделя'] = ['110 - 250 грамм']
scottish['2 недели'] = ['140 - 360 грамм']
scottish['3 недели'] = ['200 - 420 грамм']
scottish['4 недели'] = ['240 - 600 грамм']
scottish['2 месяца'] = ['400 - 900 грамм']
scottish['3 месяца'] = ['1.0 - 1.5 килограмм']
scottish['4 месяца'] = ['1.7 - 2.4 килограмм']
scottish['5 месяцев'] = ['2.2 - 2.9 килограмм']
scottish['6 месяцев'] = ['2.3 - 3.6 килограмм']
scottish['7 месяцев'] = ['2.4 - 3.9 килограмм']
scottish['8 месяцев'] = ['2.5 - 4.1 килограмм']
scottish['9 месяцев'] = ['2.5 - 4.3 килограмм']
scottish['10 месяцев'] = ['2.5 - 4.4 килограмм']
scottish['11 месяцев'] = ['2.5 - 4.5 килограмм']
scottish['12 месяцев'] = ['2.5 - 4.6 килограмм']
scottish['взрослая'] = ['2.5 - 5.5 килограмм']
scottish['стерилизованная'] = ['2.5 - 5.8 килограмм']

print("Введите возраст Вашего питомца по такому шаблону: \n")

l = list()

l.append('1 неделя')
l.append('2 недели')
l.append('3 недели')
l.append('4 недели')
l.append('1 месяц')
l.append('2 месяца')
l.append('3 месяца')
l.append('4 месяца')
l.append('5 месяцев')
l.append('6 месяцев')
l.append('7 месяцев')
l.append('8 месяцев')
l.append('9 месяцев')
l.append('10 месяцев')
l.append('11 месяцев')
l.append('12 месяцев')
l.append('взрослая')
l.append('стерилизованная\n\n')

for x in range(len(l)):
    print(l[x])

str = input()

print("\n Ваш питомец должен весить в пределах: \n")
print(scottish[str])


