'''
Created on 2 мая 2018 г.

@author: danny
#*****************************************************************
#
#Двусвязный список = возраст шотладнского котенка и его норма веса
#
#*****************************************************************
'''
#-*- coding:utf-8 -*-

SCOTTISH = {}


SCOTTISH['1 неделя'] = ['110 - 250 грамм']
SCOTTISH['2 недели'] = ['140 - 360 грамм']
SCOTTISH['3 недели'] = ['200 - 420 грамм']
SCOTTISH['4 недели'] = ['240 - 600 грамм']
SCOTTISH['2 месяца'] = ['400 - 900 грамм']
SCOTTISH['3 месяца'] = ['1.0 - 1.5 килограмм']
SCOTTISH['4 месяца'] = ['1.7 - 2.4 килограмм']
SCOTTISH['5 месяцев'] = ['2.2 - 2.9 килограмм']
SCOTTISH['6 месяцев'] = ['2.3 - 3.6 килограмм']
SCOTTISH['7 месяцев'] = ['2.4 - 3.9 килограмм']
SCOTTISH['8 месяцев'] = ['2.5 - 4.1 килограмм']
SCOTTISH['9 месяцев'] = ['2.5 - 4.3 килограмм']
SCOTTISH['10 месяцев'] = ['2.5 - 4.4 килограмм']
SCOTTISH['11 месяцев'] = ['2.5 - 4.5 килограмм']
SCOTTISH['12 месяцев'] = ['2.5 - 4.6 килограмм']
SCOTTISH['взрослая'] = ['2.5 - 5.5 килограмм']
SCOTTISH['стерилизованная'] = ['2.5 - 5.8 килограмм']

print("Введите возраст Вашего питомца по такому шаблону: \n")

LST = list()

LST.append('1 неделя')
LST.append('2 недели')
LST.append('3 недели')
LST.append('4 недели')
LST.append('1 месяц')
LST.append('2 месяца')
LST.append('3 месяца')
LST.append('4 месяца')
LST.append('5 месяцев')
LST.append('6 месяцев')
LST.append('7 месяцев')
LST.append('8 месяцев')
LST.append('9 месяцев')
LST.append('10 месяцев')
LST.append('11 месяцев')
LST.append('12 месяцев')
LST.append('взрослая')
LST.append('стерилизованная\n\n')

for x in range(len(LST)):
    print(LST[x])

STR = input()

print("\n Ваш питомец должен весить в пределах: \n")
print(SCOTTISH[STR])
